Revit 2027 API
AdvancedLossFactor.SurfaceDepreciationLossFactor Property
 The surface depreciation loss factor.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SurfaceDepreciationLossFactor { get; set; }
Public Property SurfaceDepreciationLossFactor As Double
	Get
	Set
public:
property double SurfaceDepreciationLossFactor {
	double get ();
	void set (double value);
}
member SurfaceDepreciationLossFactor : float with get, set
Property Value
Double
 The loss factor as a numerical value between 0.0 and 1.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.
See Also
Reference
AdvancedLossFactor Class
Autodesk.Revit.DB.Lighting Namespace